app/controllers/students_controller.rb

  def create
    @student = Student.create(strong_params(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-06-11 16:44:29.244933"], ["updated_at", "2018-06-11 16:44:29.244933"]]

  def update
    @student = Student.find(params[:id])
    @student.update(strong_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-06-11 16:45:08.360661"], ["id", 1]]